# SM_FromShape

## Description
Creates a Structural Member from the given shape. The shape must be polygon, polyline or 3D polygon. Returns the handle of the created Structural Member.

```pascal
FUNCTION SM_FromShape(hObj : HANDLE) : HANDLE;
```

```python

def vs.SM_FromShape(hObj):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE||

## Version
Availability: from Vectorworks 2024
## Category
* StructuralMember